In [1]:
import numpy as np
import pandas as pd

In [2]:
# 사용할 데이터 만들기.
data =  {'eng':[10,30,50,70],
         'kor':[20,40,60,80],
         'math':[90,50,20,70]}
df = pd.DataFrame(data, index = ['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

#### 산술연산

In [3]:
df + 1

   eng  kor  math
a   11   21    91
b   31   41    51
c   51   61    21
d   71   81    71

In [4]:
df * 2

   eng  kor  math
a   20   40   180
b   60   80   100
c  100  120    40
d  140  160   140

In [8]:
df['eng']= df['eng'] + 2
df

   eng  kor  math
a   12   20    90
b   32   40    50
c   52   60    20
d   72   80    70

In [9]:
# 특정 행만 값을 수정하여 계산.
df.loc['a']=df.loc['a'] + 2 
df

   eng  kor  math
a   14   22    92
b   32   40    50
c   52   60    20
d   72   80    70

In [10]:
# 선택한 행광 열만을 수정하여 원하는 값을 수정.
df.loc['b':'c', 'kor':] = [[1,2],[3,4]]
df

   eng  kor  math
a   14   22    92
b   32    1     2
c   52    3     4
d   72   80    70

#### 관계 논리 연산자

In [29]:
df[df['eng']>30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [32]:
df[(df['kor']==20)|(df['kor']==60)]

   eng  kor  math
a   10   20    90
c   50   60    20

In [33]:
df[(df['kor']>=20)& (df['kor']<=60)]

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20

In [6]:
# isin : or의 역할을 하는 함수
# kor라는 컬럼명 내에서 20과 60의 숫자만 표시.
# 딕셔너리를 이용.
df[df.isin( {'kor':[20, 60]} )]

   eng   kor  math
a  NaN  20.0   NaN
b  NaN   NaN   NaN
c  NaN  60.0   NaN
d  NaN   NaN   NaN

In [7]:
# 데이터 인덱싱을 이용하여 isin을 사용한 경우, kor라는 컬럼명 내에서 20과 40을 가지는 행을 전부 표시.
df[df['kor'].isin([20,40])]

   eng  kor  math
a   10   20    90
b   30   40    50

#### Boolean indexing

In [24]:
# numpy, series와 동일하게 작용.
# 행단위로만 작용.
df[[True, False, False, True]]

   eng  kor  math
a   10   20    90
d   70   80    70

#### query문

In [13]:
df

   eng  kor  math
a   14   22    92
b   32    1     2
c   52    3     4
d   72   80    70

In [14]:
# kor 값이 1보다 크고 40 이하인 데이터 행을 가져옴.
df.query('40 >= kor > 1')

   eng  kor  math
a   14   22    92
c   52    3     4

In [51]:
df.query('kor==20 or kor==40')

   eng  kor  math
a   10   20    90
b   30   40    50

In [15]:
# f string을 통해서도 표현이 가능.
num = 30
df.query(f'eng > {num}')

   eng  kor  math
b   32    1     2
c   52    3     4
d   72   80    70